#1. ใฃ้ ,
print("ว่างายยย",456,'ไอหนุ่ม',True,10+20,"โคตรเท่")
#2. ใช้ + มีข้อเเม้ทุกตัวที่เอามาต่อกันต้องเป็น Sring
print("ว่างายยย "+str(456)+' ไอหนุ่ม '+str(True)+' '+str(10+20)+" โคตรเท่")
#3. ใช้เมธอด format
print('ว่างายยย {} ไอหนุ่ม {} {} โคตรเท่ '.format(456,True,10+20))
print('ว่างายยย {0} ไอหนุ่ม {1} {2} โคตรเท่ '.format(456,True,10+20)) #index number
#4. ใช้ f-string
print(f"ว่างายยย {456} ไอหนุ่ม {True} {10+20} โคตรเท่")
#5. ใช้ modulas operator (%) -> %d, %f, %c, %s, .....
print('ว่างายยย %d ไอหนุ่ม %s %d โคตรเท่' %(456,True,10+20))